EDT/УТ/src/Documents/мгУчетПоМагазинамИсключения/мгУчетПоМагазинамИсключения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>мгУчетПоМагазинамИсключения</name>
  <registerRecords>InformationRegister.мгНачислениеПоИсключениям</registerRecords>
  <registerRecords>AccumulationRegister.мгЗарплатаНачисления</registerRecords>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Терминал</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокДоставок</name>
    <comment>Список доставок</comment>
    <attributes>
      <name>ДатаСмены</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.новаЭкспедиторы</types>
        <types>CatalogRef.новаВодители</types>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Тариф</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/InformationRegisters/мгНачислениеПоИсключениям/мгНачислениеПоИсключениям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>мгНачислениеПоИсключениям</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Тариф</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Терминал</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.новаЭкспедиторы</types>
      <types>CatalogRef.новаВодители</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Documents/мгУчетПоМагазинамИсключения/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр мгЗарплатаНачисления Приход
	//Движения.мгЗарплатаНачисления.Записывать = Истина;
	//Движения.мгЗарплатаНачисления.Очистить();
	//Для Каждого ТекСтрокаСписокДоставок Из СписокДоставок Цикл
	//	Движение = Движения.мгЗарплатаНачисления.Добавить();
	//	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	//	Движение.Период = Дата;
	//	Движение.Организация = ТекСтрокаСписокДоставок.Организация;
	//	Движение.Терминал = Терминал;
	//	Движение.ВидНачисления = ПредопределенноеЗначение("Справочник.мгНачисленияУдержания.ТарифПоКонтрагенту");
	//	Движение.Сотрудник = ТекСтрокаСписокДоставок.Сотрудник;
	//	Движение.Тариф = ТекСтрокаСписокДоставок.Тариф;
	//КонецЦикла;

	// регистр мгНачислениеПоИсключениям
	Движения.мгНачислениеПоИсключениям.Записывать = Истина;
	Движения.мгНачислениеПоИсключениям.Очистить();
	Для Каждого ТекСтрокаСписокДоставок Из СписокДоставок Цикл
		Движение = Движения.мгНачислениеПоИсключениям.Добавить();
		Движение.Период = ТекСтрокаСписокДоставок.ДатаСмены;
		Движение.Терминал = Терминал;
		Движение.Сотрудник = ТекСтрокаСписокДоставок.Сотрудник;
		Движение.Контрагент = ТекСтрокаСписокДоставок.Контрагент;
		Движение.Тариф = ТекСтрокаСписокДоставок.Тариф;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
